In [1]:
import pandas as pd

In [3]:
#declare movie rating dataframe: ratings from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame(
        {'movie 1': [5,4,3,3,2,1],
        'movie 2': [4,5,2,3,4,2]},
        index = ['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul'])
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [5]:
def movie_grade(rating):
    if rating == 5:
        return 'A'
    if rating == 5:
        return 'B'
    if rating == 3:
        return 'C'
    else:
        return 'F'

In [6]:
print movie_grade(5)

A

In [7]:
#use applymap function to pass in scores
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       F
Jeff        F       A
Peter       C       F
Ram         C       C
Ted         F       F
Paul        F       F

In [8]:
#data operating with statistical function
df_test_scores = pd.DataFrame(
    {'Test1': [95, 84, 73, 88, 82, 61],
    'Test2': [74, 85, 82, 73, 77, 79]},
    index = ['Jack', 'Lewis', 'Patrick', 'Rich', 'Kelly', 'Paula'])

In [9]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [10]:
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [11]:
df_test_scores.std()

Test1    11.979149
Test2     4.633213
dtype: float64

In [12]:
#Data Operation Using Groupby
df_president_name = pd.DataFrame({'first': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                'last':['Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})

In [13]:
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [14]:
grouped = df_president_name.groupby('first')

In [18]:
grp_data = grouped.get_group('George')
grp_data

    first        last
0  George        Bush
4  George  Washington

In [19]:
#sorting
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

In [20]:
#data Standardization
def standardize_tests(test):
    return (test-test.mean())/test.std() #subtract test score from mean then divdied by std

In [21]:
standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [24]:
#Apply the function to the entire set
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests) #apply can return both series or df but applymap only for dataframe
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

In [25]:
#Merge, Duplicate and concatenation
#define the student data frame with math data
df_student_math = pd.DataFrame({'student': ['Tom', 'Jack', 'Dan', 'Ram', 'Jeff', 'David'],
                              'ID':[10, 56, 31, 85, 9, 22]})

In [26]:
#define the student data frame with science data
df_student_science = pd.DataFrame({'student':['Tom', 'Ram', 'David'],
                                  'ID': [10, 12, 22]})

In [27]:
#merge both dataframes to form a single data frame with math and science data
pd.merge(df_student_math, df_student_science)

   ID student
0  10     Tom
1  22   David

In [28]:
#merge with key on student
pd.merge(df_student_math, df_student_science, on='student')

   ID_x student  ID_y
0    10     Tom    10
1    85     Ram    12
2    22   David    22

In [29]:
#merge left join on key ID and also fill NaN values with X
pd.merge(df_student_math, df_student_science, on='ID', how='left').fillna('X')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack         X
2  31       Dan         X
3  85       Ram         X
4   9      Jeff         X
5  22     David     David

In [30]:
#concatenate dataframes
pd.concat([df_student_math, df_student_science], ignore_index=True)

   ID student
0  10     Tom
1  56    Jack
2  31     Dan
3  85     Ram
4   9    Jeff
5  22   David
6  10     Tom
7  12     Ram
8  22   David

In [31]:
#define new data frame with student survey data
df_student_survey_data = pd.DataFrame({'student':['Tom', 'Jack', 'Tom', 'Ram', 'Jeff', 'Jack'],
                    'ID': [10, 56, 10, 85, 9, 56]})

In [32]:
#view the dataframe
df_student_survey_data

   ID student
0  10     Tom
1  56    Jack
2  10     Tom
3  85     Ram
4   9    Jeff
5  56    Jack

In [33]:
#check for duplicate values
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [34]:
#drop duplicate values with student as key
df_student_survey_data.drop_duplicates('student')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [35]:
#drop duplicate values with ID as Key
df_student_survey_data.drop_duplicates('ID')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff